Revit 2024 API
CurveLoop.GetExactLength Method
 Returns the sum of exact lengths of all curves in the loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double GetExactLength()
Visual Basic
Public Function GetExactLength As Double
Visual C++
public:
double GetExactLength()
Return Value
 The total length of the curves in the loop.
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace